lib/virtualis/messages/detail_carte_virtuelle.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="1">
      </wsse:Security>
   </soap:Header>
   <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ns1:detailCarteVirtuelle xmlns:ns1="http://webservice.virtualis.gicm.net/">
         <detailCarteVirtuelleBean>
            <contrat><%=@params[:contrat]%></contrat>
            <efs><%=@params[:efs]%></efs>
            <identifiant><%=@params[:identifiant]%></identifiant>
            <reference><%=@params[:reference]%></reference>
         </detailCarteVirtuelleBean>
      </ns1:detailCarteVirtuelle>
   </soap:Body>
</soap:Envelope>